&НаКлиенте
Процедура Отправить(Команда)
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСтрокуОтвета(СтрокаОтвета)
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	Пока ЧтениеJSON.Прочитать() Цикл
		Сообщить(ЧтениеJSON.ТекущееЗначение);
	КонецЦикла;
	
    //ЧтениеJSON = Новый ЧтениеJSON();
    //ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
    //Результат = ПрочитатьJSON(ЧтениеJSON);
    //ЧтениеJSON.Закрыть();
        //Если Результат.ok = Истина Тогда
			//Для Каждого СтрокаРезультата Из Результат.result Цикл  
					
                   //Если СтрокаРезультата.message.text = "/start" Тогда
                   //      ВывестиПриветствие(СтрокаРезультата.message.chat.id)
                   //КонецЕсли; 
           //КонецЦикла;
    //КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Получить(Команда)
	BOT_TOKEN = "5716297232:AAHqrNJ2WVgWs9w6gdv354sVmVhx_z9vV2A";
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	 
 	Запрос = Новый HTTPЗапрос("/bot" + BOT_TOKEN + "/getMe");
 	Результат = Соединение.Получить(Запрос);  
	Строка = Результат.ПолучитьТелоКакСтроку("UTF8");
	ЭтотОбъект.Ответ.ДобавитьСтроку(Строка);
	 
КонецПроцедуры
