&НаСервере
Процедура ПрочитатьСтрокуОтвета(СтрокаОтвета)
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	Пока ЧтениеJSON.Прочитать() Цикл
		Сообщить(ЧтениеJSON.ТекущееЗначение);
	КонецЦикла;
	
    //ЧтениеJSON = Новый ЧтениеJSON();
    //ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
    //Результат = ПрочитатьJSON(ЧтениеJSON);
    //ЧтениеJSON.Закрыть();
        //Если Результат.ok = Истина Тогда
			//Для Каждого СтрокаРезультата Из Результат.result Цикл  
					
                   //Если СтрокаРезультата.message.text = "/start" Тогда
                   //      ВывестиПриветствие(СтрокаРезультата.message.chat.id)
                   //КонецЕсли; 
           //КонецЦикла;
    //КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Получить(Команда)
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос("/bot" + Токен + "/getMe");
 	Результат = Соединение.Получить(Запрос);  
	Строка = Результат.ПолучитьТелоКакСтроку("UTF8");
	ЭтотОбъект.Ответ.ДобавитьСтроку(Строка);
КонецПроцедуры	

&НаКлиенте
Процедура ПолучитьТокен(Команда)
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать("C:\tmp\token.txt");
	//Сообщить(Текст.ПолучитьСтроку(1));
	Токен = Текст.ПолучитьСтроку(1);
	
КонецПроцедуры
